[
  {
    "name": "Alienware m16 QHD+ 240Hz Gaming Laptop",
    "price": 2699.99,
    "quantity": 10,
    "description": "The new Alienware m16 is 16-inch high-performance gaming laptop with the latest CPU and GPU offerings and thermals that harness its power for smooth and stable performance. Get innovative and powerful performance with the latest 13th generation Intel Core i9 processor and NVIDIA GeForce RTX 40 Series graphics cards.",
    "features": {
      "Windows 11 Home Operating System": "Windows 11 has all the power and security of Windows 10 with a redesigned and refreshed look. It also comes with new tools, sounds, and apps. Every detail has been considered. All of it comes together to bring you a refreshing experience on your PC.",
      "13th Gen Intel Core i9 13900HX Processor": "Extend beyond performance to let your PC do even more at once. Juggle complex programs without slowing you down, enjoy ultra-immersive streaming in 8K, and unleash the performance needed to keep up with the most demanding creativity software.",
      "16GB system memory": "Reams of high-bandwidth DDR5 RAM to smoothly run your graphics-heavy PC games and video-editing applications, as well as numerous programs and browser tabs all at once.",
      "1TB NVMe M.2 PCIe Solid State Drive": "Save files fast and store more data. With massive amounts of storage and advanced communication power, PCI-e SSDs are great for major gaming applications, multiple servers, daily backups, and more.",
      "NVIDIA GeForce RTX 4080 Graphics": "Backed by 12GB GDDR6 dedicated video memory for a fast, advanced GPU to fuel your games.",
      "State of the Art Cooling": "Alienware Cryo-tech features a large vapor chamber, quad fans, seven heat pipes, and the exclusive Element 31 thermal interface material to regulate internal temperature."
    },
    "isNew": true,
    "image": ["https://i.imgur.com/Wncg4vl.png","https://i.imgur.com/pRIvF4Q.png","https://i.imgur.com/yGymWpp.png","https://i.imgur.com/EBu6xlv.png"],
    "specification": {
      "Brand": "Alienware",
      "Model Number": "AWM16-9272BLK-PUS",
      "Year of Release": "2023",
      "Color": "Dark Metallic Moon",
      "Screen Size": "16 inches",
      "Screen Resolution": "2560 x 1600",
      "Touch Screen": "No",
      "Processor Model": "Intel Core i7",
      "Processor Speed": "5.4 gigahertz",
      "Memory": "32GB RAM",
      "Storage Type": "SSD",
      "Total Storage Capacity": "1000 gigabytes",
      "Solid State Drive Capacity": "1000 gigabytes",
      "System Memory (RAM)": "16 gigabytes",
      "Graphics": "NVIDIA GeForce RTX 4080",
      "Operating System": "Windows 11 Home"
    },
    "comments": []
  },
  {
    "name": "MSI GE76 Raider 17.3 inch Gaming Laptop",
    "price": 2499.99,
    "quantity": 10,
    "description": "Experience ultimate gaming performance with the MSI GE76 Raider Gaming Laptop. Powered by the latest Intel Core i9 processor and equipped with 32GB of RAM, this laptop delivers exceptional speed and multitasking capabilities. The 1TB NVMe SSD provides lightning-fast storage and quick game load times. Immerse yourself in stunning visuals with the NVIDIA GeForce RTX 3080 graphics card and the 17.3-inch FHD 300hz display.",
    "features": {
      "Windows 11 Home Operating System": "Windows 11 Home is a powerful and secure operating system that offers a redesigned and refreshed look. It comes with new tools, sounds, and apps, providing a refreshing experience on your PC.",
      "13th Gen Intel Core i9 13900HX Processor": "The MSI GE76 Raider is equipped with the 13th Gen Intel Core i9 13900HX Processor, which offers incredible performance and power efficiency for demanding tasks and gaming.",
      "16GB system memory": "The laptop features 16GB of high-bandwidth system memory, allowing for smooth multitasking and seamless performance in graphics-intensive applications and games.",
      "1TB NVMe M.2 PCIe Solid State Drive": "Save files fast and store more data. With the 1TB NVMe M.2 PCIe SSD, you can enjoy rapid storage and have ample space for your games, files, and multimedia content.",
      "NVIDIA GeForce RTX 3080 Graphics": "Experience stunning visuals and realistic graphics with the NVIDIA GeForce RTX 3080 graphics card. It delivers exceptional performance and immerses you in the world of gaming.",
      "State of the Art Cooling": "The MSI GE76 Raider features state-of-the-art cooling technology with multiple fans and advanced heat dissipation solutions to keep the laptop cool during intense gaming sessions, ensuring optimal performance."
    },
    "isNew": true,
    "image": ["https://i.imgur.com/P4ZCnvY.png","https://i.imgur.com/bBU5QyE.png","https://i.imgur.com/LYlLsDT.png","https://i.imgur.com/UWU0SEc.png"],
    "specification": {
      "Brand": "MSI",
      "Model Number": "GE76 Raider",
      "Year of Release": "2023",
      "Color": "Black",
      "Screen Size": "17.3 inches",
      "Screen Resolution": "1920 x 1080",
      "Touch Screen": "No",
      "Processor Model": "Intel Core i9",
      "Processor Speed": "3.5 GHz",
      "Memory": "32GB DDR4",
      "Storage Type": "NVMe SSD",
      "Total Storage Capacity": "1TB",
      "Solid State Drive Capacity": "1TB",
      "System Memory (RAM)": "16 gigabytes",
      "Graphics": "NVIDIA GeForce RTX 3080",
      "Operating System": "Windows 11 Home"
    },
    "comments": []
  },
  {
    "name": "Razer Blade Pro 17.3 inch Gaming Laptop",
    "price": 3499.99,
    "quantity": 8,
    "description": "Elevate your gaming experience with the Razer Blade Pro Gaming Laptop. Featuring a powerful Intel Core i9 processor and 32GB of RAM, this laptop delivers exceptional performance and responsiveness. The 1TB NVMe SSD provides ample storage space and rapid data access. Immerse yourself in stunning visuals with the NVIDIA GeForce RTX 3080 graphics card and the 17.3-inch 4K OLED display. With its sleek and portable design, the Razer Blade Pro is perfect for gaming on the go.",
    "features": {
      "Windows 11 Home Operating System": "Experience the power and versatility of Windows 11 Home. With its intuitive interface and new features, it offers a seamless and productive computing experience.",
      "11th Gen Intel Core i9 Processor": "The Razer Blade Pro is equipped with the latest 11th Gen Intel Core i9 processor, delivering exceptional performance and speed for gaming, content creation, and more.",
      "32GB system memory": "Experience smooth multitasking and effortless performance with 32GB of high-speed system memory, allowing you to run multiple applications and games simultaneously.",
      "1TB NVMe M.2 PCIe Solid State Drive": "The 1TB NVMe M.2 PCIe SSD provides lightning-fast storage and quick access to your games, files, and multimedia content.",
      "NVIDIA GeForce RTX 3080 Graphics": "Powered by the NVIDIA GeForce RTX 3080 graphics card, the Razer Blade Pro delivers stunning visuals and immersive gaming experiences with real-time ray tracing and AI-enhanced graphics.",
      "Advanced Cooling System": "The Razer Blade Pro features an advanced cooling system with vapor chamber technology and multiple heat pipes, ensuring optimal performance and temperature management during intense gaming sessions."
    },
    "isNew": true,
    "image": ["https://i.imgur.com/wZ6TkDs.png","https://i.imgur.com/4DT7AYv.png","https://i.imgur.com/yh3OGSF.png","https://i.imgur.com/7px4U3o.png"],
    "specification": {
      "Brand": "Razer",
      "Model Number": "Blade Pro",
      "Year of Release": "2023",
      "Color": "Black",
      "Screen Size": "17.3 inches",
      "Screen Resolution": "3840 x 2160",
      "Touch Screen": "No",
      "Processor Model": "Intel Core i9",
      "Processor Speed": "2.9 GHz",
      "Memory": "32GB DDR4",
      "Storage Type": "NVMe SSD",
      "Total Storage Capacity": "1TB",
      "Solid State Drive Capacity": "1TB",
      "System Memory (RAM)": "32 gigabytes",
      "Graphics": "NVIDIA GeForce RTX 3080",
      "Operating System": "Windows 11 Home"
    },
    "comments": []
  },
  {
    "name": "Alienware m17 R5 17.3 inch Gaming Laptop",
    "price": 4299.99,
    "quantity": 12,
    "description": "Unleash your gaming potential with the Alienware m17 R5 Gaming Laptop. Powered by the Intel Core i9 processor and 32GB of RAM, this laptop delivers exceptional performance for demanding games and applications. The 2TB PCIe SSD provides lightning-fast storage and quick load times. Immerse yourself in stunning visuals with the NVIDIA GeForce RTX 3080 graphics card and the 17.3-inch 4K UHD display. With its sleek design and customizable AlienFX lighting, the Alienware m17 R5 combines power and style for the ultimate gaming experience.",
    "features": {
      "Windows 11 Home Operating System": "Experience the latest features and enhancements with Windows 11 Home. It offers a seamless and secure computing environment, allowing you to enjoy your games and applications with confidence.",
      "11th Gen Intel Core i9 Processor": "The Alienware m17 R5 is equipped with the 11th Gen Intel Core i9 processor, delivering exceptional performance and responsiveness for intense gaming and multitasking.",
      "32GB system memory": "Experience smooth and efficient multitasking with 32GB of high-speed system memory, allowing you to run multiple applications and games simultaneously.",
      "2TB PCIe SSD": "The 2TB PCIe SSD provides ample storage space for your games, media files, and applications, ensuring quick access and fast load times.",
      "NVIDIA GeForce RTX 3080 Graphics": "Enjoy realistic graphics and immersive gaming experiences with the NVIDIA GeForce RTX 3080 graphics card, featuring real-time ray tracing and AI-enhanced graphics rendering.",
      "Advanced Cooling System": "The Alienware m17 R5 features an advanced cooling system with vapor chamber technology and high-performance fans, keeping the laptop cool during intense gaming sessions.",
      "AlienFX Lighting": "Customize the lighting effects of your laptop with AlienFX, creating a personalized and immersive gaming atmosphere."
    },
    "isNew": true,
    "image": ["https://i.imgur.com/epcKq1S.png","https://i.imgur.com/gTyQDZU.png","https://i.imgur.com/GuKOWjk.png","https://i.imgur.com/3HqpMBD.png"],
    "specification": {
      "Brand": "Alienware",
      "Model Number": "m17 R5",
      "Year of Release": "2023",
      "Color": "Lunar Light",
      "Screen Size": "17.3 inches",
      "Screen Resolution": "3840 x 2160",
      "Touch Screen": "No",
      "Processor Model": "Intel Core i9",
      "Processor Speed": "2.8 GHz",
      "Memory": "32GB DDR4",
      "Storage Type": "PCIe SSD",
      "Total Storage Capacity": "2TB",
      "Solid State Drive Capacity": "2TB",
      "System Memory (RAM)": "32 gigabytes",
      "Graphics": "NVIDIA GeForce RTX 3080",
      "Operating System": "Windows 11 Home"
    },
    "comments": []
  },
  {
    "name": "Logitech - G733 LIGHTSPEED Wireless DTS Headphone",
    "price": 139.99,
    "quantity": 15,
    "description": "Meet G733, a gaming headset designed to suit your style. Embrace total wireless with 2.4 GHZ LIGHTSPEED wireless, featuring up to 33 ft of range and up to 29 hours of battery life. Customize how you look and sound in G HUB with dual-zone, front-facing LIGHTSYNC RGB and Blue VO!CE real-time voice filters. G733 features advanced audio technologies, including 40 mm PRO-G audio drivers, internal acoustic chambers, and DTS Headphone:X 2.0. Play your way with four colorways to choose from and play with comfort with a comfortable, reversible headband, dual-layer memory foam earcups, and a lightweight headset that weighs just 9.8 oz.",
    "features": {
      "Immersive sound": "This headset's PRO-G drivers are designed to significantly reduce distortion and reproduce precise, consistent, rich sound quality.",
      "Comfortable, colorful suspension headband": "Colorful, reversible suspension headbands are designed for comfort during long play sessions.",
      "Rechargeable battery": "Offers up to 29 hours of gaming per charge, so you'll always be ready to play.",
      "Console compatible": "PlayStation 5, PlayStation 4, Nintendo Switch in Dock. (Stereo sound only via USB wireless dongle)",
      "2.4GHz LIGHTSPEED wireless": "Total freedom with up to 66 ft wireless range and LIGHTSPEED wireless audio transmission.",
      "Soft dual-layer memory foam": "Conforms to your head and reduces stress points for long-lasting comfort."
    },
    "isNew": true,
    "image": ["https://i.imgur.com/3HqpMBD.png","https://i.imgur.com/yVu6mpk.png","https://i.imgur.com/H0eFS6a.png"],
    "specification": {
      "Brand": "Logitech",
      "Color": "Black",
      "Type": "Over-Ear",
      "Wireless": "Yes",
      "Noise Cancelling": "No",
      "Sound Mode": "DTS Headphone:X",
      "Wireless Connectivity": "Radio Frequency (RF)",
      "Maximum Wireless Range": "66 feet",
      "Built-In Microphone": "Yes",
      "Microphone Features": "Detachable, Noise cancelling",
      "Battery Life": "29 hours",
      "Minimum Frequency Response": "20 hertz"
    },
    "comments": []
  },
  {
    "name": "Sennheiser - Momentum 4 Wireless Headphones",
    "price": 379.99,
    "quantity": 3,
    "description": "The new MOMENTUM 4 Wireless once again raises the bar - delivering world class sound quality with advanced Adaptive Noise Cancellation and exceptional comfort. With smart, intuitive features that enhance every interaction and an outstanding 60-hour battery life, there's nothing between you and an incredible listening experience.",
    "features": {
      "THX Spatial Audio": "Immerse yourself in realistic, 360-degree spatial sound for enhanced gaming experiences.",
      "TriForce Titanium 50mm Drivers": "Enjoy rich, immersive audio with high-end sound clarity and powerful bass.",
      "Detachable HyperClear Supercardioid Microphone": "Communicate clearly with your teammates thanks to the detachable microphone with advanced voice isolation technology.",
      "Lightweight Design": "The headset is designed to be lightweight and comfortable, allowing for long gaming sessions without discomfort.",
      "Razer Chroma RGB Lighting": "Customize the headset's lighting effects with over 16.8 million colors and a variety of lighting presets.",
      "Up to 24 Hours of Battery Life": "Game wirelessly for extended periods with up to 24 hours of battery life on a single charge.",
      "Plush Memory Foam Ear Cushions": "Experience superior comfort with plush memory foam ear cushions that conform to the shape of your ears."
    },
    "isNew": true,
    "image": ["https://i.imgur.com/QSJpinj.png","https://i.imgur.com/WHt8z9T.png","https://i.imgur.com/QIdYyI9.png"],
    "specification": {
      "Brand": "Sennheiser",
      "Color": "Black",
      "Type": "Over-Ear",
      "Wireless": "Yes",
      "Noise Cancelling": "No",
      "Sound Mode": "THX Spatial Audio",
      "Wireless Connectivity": "2.4 GHz Wireless",
      "Maximum Wireless Range": "30 feet",
      "Built-In Microphone": "Yes",
      "Microphone Features": "Detachable, HyperClear Supercardioid",
      "Battery Life": "Up to 24 hours",
      "Minimum Frequency Response": "12 hertz"
    },
    "comments": []
  },
  {
    "name": "Sony - WF1000XM4 True Wireless Headphones",
    "price": 279.99,
    "quantity": 15,
    "description": "Take the next step in truly wireless noise canceling performance and exceptional sound quality. The new Integrated Processor V1 delivers unmatched performance while using even less power. Adding in drastically enhanced call quality, IPX4 water resistance and up to 24 hours of battery life with wireless charging.",
    "features": {
      "THX Spatial Audio": "Immersive 360-degree surround sound delivers precise positional audio for a competitive edge in gaming.",
      "Razer HyperSense Technology": "Haptic feedback technology provides realistic vibrations in sync with the audio for enhanced immersion.",
      "2.4 GHz Wireless": "Enjoy lag-free, high-fidelity wireless audio with a range of up to 30 feet.",
      "Cooling Gel-Infused Ear Cushions": "Stay cool and comfortable during extended gaming sessions with gel-infused ear cushions that reduce heat build-up.",
      "Game/Chat Balance": "Easily adjust the balance between in-game audio and team communication for optimal sound mixing.",
      "Retractable Mic with HyperClear Supercardioid": "The built-in microphone captures clear and accurate voice communication while reducing background noise.",
      "Customizable RGB Lighting": "Personalize your headset with Razer Chroma RGB lighting, offering a wide range of colors and effects."
    },
    "isNew": true,
    "image": ["https://i.imgur.com/Gc4Szn5.png","https://i.imgur.com/8fHmXHc.png","https://i.imgur.com/PHakOls.png"],
    "specification": {
      "Brand": "Sony",
      "Color": "Black",
      "Type": "Over-Ear",
      "Wireless": "Yes",
      "Noise Cancelling": "Yes",
      "Sound Mode": "THX Spatial Audio",
      "Wireless Connectivity": "2.4 GHz Wireless",
      "Maximum Wireless Range": "30 feet",
      "Built-In Microphone": "Yes",
      "Microphone Features": "Detachable, HyperClear Supercardioid",
      "Battery Life": "Up to 24 hours",
      "Minimum Frequency Response": "12 hertz"
    },
    "comments": []
  },
  {
    "name": "Bose - QuietComfort Earbuds II",
    "price": 299,
    "quantity": 9,
    "description": "Experience customized audio and acclaimed noise cancellation with Bose QuietComfort Earbuds II True Wireless Noise Cancelling In-Ear Headphones, featuring pioneering CustomTune sound calibration technology that intelligently personalizes the noise cancellation and sound performance to your ears. These true wireless earbuds represent a revolutionary advance in noise cancellation and deliver lifelike, balanced sound with nuance, clarity, and depth. The simple touch interface provides device-free control of music, calls and noise cancellation levels, including Quiet Mode for maximum noise cancellation and Aware Mode for keeping an ear to your surroundings. Find a secure fit for your ear shape with the included Bose Fit Kit, which contains three sizes of ear tips and stability bands, all made from soft silicone for continuous comfort. Own your uniqueness with the Bose QuietComfort Earbuds II. Now available in Limited-edition Eclipse Gray and Midnight Blue, as well as Triple Black and Soapstone.",
    "features": {
      "High-Fidelity Audio": "40mm neodymium drivers deliver immersive audio with deep bass and clear highs.",
      "DTS Headphone:X v2.0 Surround Sound": "Experience accurate and precise positional audio for a competitive edge in gaming.",
      "Dual Wireless Technology": "Enjoy lag-free, lossless audio on both PC and PlayStation 4 with the included wireless transmitter.",
      "Swappable Batteries": "Hot-swappable batteries allow you to game without interruptions and extend your playtime.",
      "ClearCast Bidirectional Microphone": "The retractable microphone provides clear and natural voice communication with noise cancellation.",
      "AirWeave Ear Cushions": "The breathable and soft AirWeave ear cushions ensure long-lasting comfort during extended gaming sessions.",
      "ChatMix Dial": "Easily adjust the balance between in-game audio and voice chat on the fly.",
      "RGB Illumination": "Customize the headset with dynamic RGB lighting effects for a personalized gaming setup."
    },
    "isNew": false,
    "image": ["https://i.imgur.com/TRv0Sye.png","https://i.imgur.com/wdioTNV.png"],
    "specification": {
      "Brand": "Bose",
      "Color": "Black",
      "Type": "Over-Ear",
      "Wireless": "Yes",
      "Noise Cancelling": "Yes",
      "Sound Mode": "DTS Headphone:X v2.0",
      "Wireless Connectivity": "2.4 GHz Wireless",
      "Maximum Wireless Range": "40 feet",
      "Built-In Microphone": "Yes",
      "Microphone Features": "Retractable, Bidirectional",
      "Battery Life": "Up to 20 hours",
      "Minimum Frequency Response": "10 hertz"
    },
    "comments": []
  },
  {
    "name": "GIGABYTE - NVIDIA GeForce RTX 4070 Ti",
    "price": 899.99,
    "quantity": 0,
    "description": "Ahead of its time, ahead of the game is the GIGABYTE GeForce RTX 4070 Ti GAMING OC 12G Graphics Cards. Powered by NVIDIA's new RTX architecture, the GIGABYTE GeForce RTX 4070Ti GAMING OC 12G brings stunning visuals, amazingly fast frame rates, and AI acceleration to games and creative applications with its enhanced RT Cores and Tensor Cores, along with a staggering 12 GB of GDDR6X memory.",
    "features": {
      "NVIDIA Technologies": "Powered by NVIDIA DLSS 3, ultra-efficient Ada Lovelace arch, and full ray tracing.",
      "Graphics Processing Unit (GPU)/Clock Speed": "NVIDIA Ada Lovelace, with 2310MHz core clock and 2610MHz boost clock speeds to help meet the needs of demanding games.",
      "On Board Memory": "12GB GDDR6X (192-bit) on-board memory, plus 7680 CUDA processing cores and up to 504GB/sec of memory bandwidth provide the memory needed to create striking visual realism.",
      "Interface": "PCI Express 4.0 interface - Offers compatibility with a range of systems. Also includes DisplayPort and HDMI outputs for expanded connectivity.",
      "NVIDIA GeForce Experience": "Capture and share videos, screenshots, and livestreams with friends. Keep your drivers up to date and optimize your game settings. It's the essential companion to your GeForce graphics card."
    },
    "isNew": true,
    "image": ["https://i.imgur.com/uAS63lo.png","https://i.imgur.com/Zyb7auL.png","https://i.imgur.com/SR75twT.png","https://i.imgur.com/7u64dAd.png"],
    "specification": {
      "Brand": "GIGABYTE",
      "Color": "Black",
      "Maximum Digital Resolution": "8K (4320p)",
      "GPU Clock Speed": "2310 megahertz",
      "GPU Boost Clock Speed": "2640 megahertz",
      "Video Memory Capacity": "12 gigabytes",
      "Type of Memory (RAM)": "12GB GDDR6X",
      "Product Height": "66.55 millimeters"
    },
    "comments": []
  },
  {
    "name": "ASUS - ROG Strix GeForce RTX 4090",
    "price": 1599.99,
    "quantity": 10,
    "description": "Experience unparalleled gaming performance with the ASUS ROG Strix GeForce RTX 4090. Equipped with the latest NVIDIA Ampere architecture, this graphics card delivers stunning visuals, real-time ray tracing, and AI-powered DLSS technology. The ROG Strix GeForce RTX 4090 features a massive 24GB GDDR6X memory, 10496 CUDA cores, and a boost clock speed of 2100MHz, ensuring smooth gameplay even in the most demanding titles. With advanced cooling solutions, customizable RGB lighting, and robust build quality, this graphics card is designed for gamers who demand the best.",
    "features": {
      "NVIDIA Ampere Architecture": "The latest NVIDIA Ampere architecture provides superior performance and power efficiency.",
      "Real-Time Ray Tracing": "Experience realistic lighting, reflections, and shadows with real-time ray tracing technology.",
      "DLSS Technology": "AI-powered DLSS technology enhances gaming performance by delivering high-quality visuals with increased frame rates.",
      "24GB GDDR6X Memory": "The large 24GB GDDR6X memory ensures smooth and responsive gameplay in high-resolution environments.",
      "Triple Axial-Tech Fans": "The triple axial-tech fans provide maximum airflow and cooling performance, keeping the graphics card running at optimal temperatures.",
      "RGB Lighting": "Customizable RGB lighting allows you to personalize the look of your gaming rig.",
      "Premium Build Quality": "The ROG Strix graphics card features a reinforced frame and high-quality components for durability and reliability."
    },
    "isNew": true,
    "image": ["https://i.imgur.com/kQDkYvj.png","https://i.imgur.com/uwiqSqj.png","https://i.imgur.com/9jbSabT.png","https://i.imgur.com/duz23Zp.png"],
    "specification": {
      "Brand": "ASUS",
      "Color": "Black",
      "Maximum Digital Resolution": "8K (4320p)",
      "GPU Clock Speed": "2010 megahertz",
      "GPU Boost Clock Speed": "2100 megahertz",
      "Video Memory Capacity": "24 gigabytes",
      "Type of Memory (RAM)": "GDDR6X",
      "Product Height": "57.4 millimeters"
    },
    "comments": []
  },
  {
    "name": "EVGA - GeForce RTX 4080 FTW3 Ultra Gaming",
    "price": 1299.99,
    "quantity": 5,
    "description": "Unleash the power of EVGA GeForce RTX 4080 FTW3 Ultra Gaming graphics card. Featuring the latest NVIDIA Ampere architecture, this graphics card delivers exceptional performance for gaming and content creation. With 12GB of GDDR6X memory, 10240 CUDA cores, and a boost clock speed of 2055MHz, it can handle the most demanding tasks and provide an immersive gaming experience. The EVGA iCX3 cooling technology keeps the card running cool and quiet, while the RGB lighting adds a stylish touch to your setup. Upgrade your gaming rig with the EVGA GeForce RTX 4080 FTW3 Ultra Gaming and enjoy cutting-edge graphics and performance.",
    "features": {
      "NVIDIA Ampere Architecture": "Experience accelerated gaming performance and real-time ray tracing with the NVIDIA Ampere architecture.",
      "12GB GDDR6X Memory": "Enjoy fast and responsive gaming with 12GB of GDDR6X memory and a memory clock speed of 19 Gbps.",
      "iCX3 Cooling Technology": "The EVGA iCX3 cooling technology ensures optimal temperature and quieter operation during intense gaming sessions.",
      "RGB Lighting": "Customize your setup with vibrant RGB lighting on the graphics card, creating a visually stunning gaming environment.",
      "Overclocking Capability": "Unlock the full potential of the graphics card with EVGA Precision X1 software for precise overclocking and performance tuning.",
      "Multiple Display Support": "Connect multiple displays with ease using the HDMI 2.1 and DisplayPort 1.4a outputs for an immersive multi-monitor setup.",
      "Virtual Reality Ready": "Experience virtual reality games and applications with smooth and immersive visuals thanks to the powerful GPU."
    },
    "isNew": true,
    "image": ["https://i.imgur.com/E8twkYK.png","https://i.imgur.com/bbZoxjR.png","https://i.imgur.com/zOpSPlp.png","https://i.imgur.com/VKUcjIX.png"],
    "specification": {
      "Brand": "EVGA",
      "Color": "Black",
      "Maximum Digital Resolution": "8K (4320p)",
      "GPU Clock Speed": "1905 megahertz",
      "GPU Boost Clock Speed": "2055 megahertz",
      "Video Memory Capacity": "12 gigabytes",
      "Type of Memory (RAM)": "GDDR6X",
      "Product Height": "136.75 millimeters"
    },
    "comments": []
  },
  {
    "name": "NVIDIA - GeForce RTX 4090 Graphics Card",
    "price": 1599.99,
    "quantity": 0,
    "description": "The NVIDIA GeForce RTX 4090 is the ultimate GeForce GPU. It brings an enormous leap in performance, efficiency, and AI-powered graphics. Experience ultra-high performance gaming, incredibly detailed virtual worlds with ray tracing, unprecedented productivity, and new ways to create. It’s powered by the NVIDIA Ada Lovelace architecture and comes with 24 GB of G6X memory to deliver the ultimate experience for gamers and creators.",
    "features": {
      "Ampere Architecture": "Powered by the advanced Ampere architecture for exceptional gaming performance and realistic visuals.",
      "24GB GDDR6X Memory": "Experience ultra-fast gaming and seamless multitasking with 24GB of GDDR6X memory and a memory clock speed of 21 Gbps.",
      "Real-Time Ray Tracing": "Enjoy lifelike lighting, reflections, and shadows with real-time ray tracing technology.",
      "DLSS Technology": "Boost performance and image quality with DLSS technology, which uses AI to upscale and enhance in-game visuals.",
      "AI Acceleration": "Leverage the power of AI for faster rendering, video editing, and other creative tasks.",
      "Triple Fan Cooling": "The triple fan cooling system keeps the card cool and ensures optimal performance even during intense gaming sessions.",
      "Supports Multiple Monitors": "Connect multiple monitors for an immersive gaming or productivity setup with HDMI 2.1 and DisplayPort 1.4a outputs."
    },
    "isNew": true,
    "image": ["https://i.imgur.com/pzPp5ws.png","https://i.imgur.com/VNPYxdS.png","https://i.imgur.com/pVdOqOR.png","https://i.imgur.com/D9eWlLl.png"],
    "specification": {
      "Brand": "NVIDIA",
      "Color": "Black",
      "Maximum Digital Resolution": "8K (4320p)",
      "GPU Clock Speed": "2040 megahertz",
      "GPU Boost Clock Speed": "2155 megahertz",
      "Video Memory Capacity": "24 gigabytes",
      "Type of Memory (RAM)": "GDDR6X",
      "Product Height": "120 millimeters"
    },
    "comments": []
  }
]